## HW_SkillBox - Репозиторий с домашками с курса SkillBox "C# - Разработчик"

### Ниже условия домашек. Решения в модулях в коде
<details>
  <summary>Модуль 1</summary>   
  <details>  
    <summary>Задание 1</summary>
Что нужно сделать
У программистов есть традиция — первое приложение на новом языке программирования приветствует мир. Давайте поприветствуем мир на языке C#.

Для выполнения задания: 

Установите IDE Visual Studio. 
Создайте новое консольное приложение.
Добавьте оператор вывода на экран Console.WriteLine и с его помощью выведите надпись: Hello World!!!
Добавьте задержку Console.ReadKey, чтобы приложение не закрывалось по завершении выполнения.
Это задание — простое, ведь это ваша первая программа. Оно почти полностью разобрано в видеоуроках. 

  </details>
  <details>
    <summary>Задание 2</summary>
Цель
Научиться различать операторы Write и WriteLine.

Что нужно сделать
Методы Write и WriteLine очень похожи, но у них есть важное различие. Метод Write не переносит строку после того, как произошёл вывод на экран. Разработайте приложение, которое покажет вам разницу между этими двумя операторами:

Выведите на экран надпись Hello World!!!, используя метод Console.Write. 
Используйте Console.Write для каждого слова (у вас будет три вызова метода: сначала для слова Hello, потом для слова World, а затем — для трёх восклицательных знаков).
Чтобы слова не «слипались», используйте пробелы внутри кавычек.
Добавьте задержку Console.ReadLine, чтобы приложение не закрывалось по завершении выполнения.
  </details>
</details>
<details>
<summary>Модуль 2</summary>
<details>
  <summary>Задание 1</summary>
  Задание 1. Создание переменных и вывод
Что нужно сделать
Объявите несколько переменных, которые будут хранить следующие значения:

- Ф. И. О.
- Возраст
- Email
- Баллы по программированию
- Баллы по математике
- Баллы по физике

Каждая переменная должна иметь:

- Название, что-либо обозначающее на английском языке.
- Тип данных, который наилучшим образом подходит для этой переменной.
Например, для Ф. И. О. можно указать наименование переменной fullName. Локальные переменные принято именовать, начиная со строчной буквы, а все следующие слова, которые входят в название переменной, — с заглавной. Этот стиль называется camelCase.
Дальше выведите всю информацию на экран. Организуйте форматированный вывод данных на экран.

Для решения этой задачи объявите переменные для данных, указанных выше, как это было показано в видео 2.2.

</details>  
 <details>
  <summary>Задание 2</summary>
Создайте две переменные для подсчёта суммы баллов по всем предметам и рассчитайте среднее арифметическое значение. Для этого:

Создайте переменную под сумму баллов по всем предметам.
Посчитайте сумму баллов.
Создайте переменную под средний балл.
Рассчитайте среднее арифметическое баллов.
Выведите информацию на экран.
</details>  

</details> 
<details>
  <summary>Модуль 3</summary>   
  <details>  
    <summary>Задание 1. Приложение по определению чётного или нечётного числа</summary>
Напишите приложение, которое определяет чётное или нечётное число. Алгоритм приложения выглядит следующим образом:

На экране программа с помощью оператора Console.WriteLine предлагает пользователю ввести целое число.
С помощью оператора Console.ReadLine считывается введённое число.
С помощью метода int.Parse число преобразуется в целочисленную переменную.
С помощью оператора деления с остатком определяется, чётное число или нечётное.
В зависимости от предыдущего шага на экран выводится текст, является ли данное число чётным или нет.
  </details>   
  <details>  
    <summary>Задание 2. Программа подсчёта суммы карт в игре «21»</summary>
Есть довольно простая карточная игра, она называется «21». Суть игры сводится к подсчёту карт. Каждая карта имеет свой «вес». Напишите программу, которая подсчитает сумму всех карт у вас на руках. Задача программы сводится к следующему алгоритму:

1. Программа приветствует пользователя и спрашивает, сколько у него на руках карт.
2. Пользователь вводит целое число.
3. Преобразуем это число в счётчик для цикла.
4. С помощью цикла for итеративно просим пользователя ввести номинал каждой карты. Для карт с числовым номиналом он вводит только цифру. 
Для «картинок» следует принять обозначения латинскими буквами:
 - Валет = J
 - Дама = Q
 - Король = K
 - Туз = T
5. Внутри цикла, используя оператор switch, «вес» каждой карты складываем в общую переменную суммы, которая объявлена до тела основного цикла.
Для числовых карт их «вес» равен весу, указанному при вводе пользователем. Для «картинок» «вес» равен 10.
6. По завершении ввода на экране появится значение суммы карт.
  </details>   
  <details>  
    <summary>Задание 3. Проверка простого числа</summary>
    Эта задача — одна из самых распространённых и популярных. Простое число — число, которое делится само на себя и на единицу. Есть много алгоритмов поиска простых чисел. Реализуйте один из самых лёгких. Проверьте введённое с клавиатуры целое число на признак простоты. Чтобы закрепить знания, реализуйте эту задачу, используя цикл while.

1. Для начала пользователь вводит целое число.
2. Затем в цикле нужно перебрать все числа, начиная с 1 и до N − 1.
3. Входное число N при каждой итерации цикла нужно делить на число, которое получается в цикле с остатком.
4. Если остаток от деления равен 0, значит, программа нашла делитель этого числа, и потому это число уже не может являться простым числом.
5. Если остаток от деления равен 0, то переменной bool, объявленной за рамками цикла, следует присвоить значение true.
6. Если после выхода из цикла значение переменной осталось false, значит, число простое. Если значение переменной стало true, значит, был найден делитель, поэтому число не может считаться простым.
  </details>   
  <details>  
    <summary>Задание 4. Наименьший элемент в последовательности</summary>
Найдите наименьший элемент в последовательности, которую вводит пользователь. Детальный алгоритм программы:

1. Пользователь вводит длину последовательности. 
2. Затем пользователь последовательно вводит целые числа (как положительные, так и отрицательные). Числа разделяются клавишей Enter.
3. Каждое введённое число сравнивается со значением переменной, отвечающей за минимальный элемент. Если введённое число оказывается меньше, то нужно обновить значение переменной.
  </details>   
  <details>  
    <summary>Задание 5. Игра «Угадай число»</summary>
    Разработайте программу по следующему алгоритму:

1. Пользователь вводит максимальное целое число диапазона.
2. На основе диапазона целых чисел (от 0 до «введено пользователем») программа генерирует случайное целое число из диапазона. 
3. Пользователю предлагается ввести загаданное программой случайное число. Пользователь вводит свои предположения в консоли приложения. 
  - Если число меньше загаданного, программа сообщает об этом пользователю. 
  - Если больше, то тоже сообщает, что число больше загаданного.
4. Программа завершается, когда пользователь угадывает число. 
5. Если пользователь устал играть, то вместо ввода числа он вводит пустую строку и нажимает Enter. Тогда программа завершается, предварительно показывая, какое число было загадано.
  </details>
</details>
  
